; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v2 - type_3 ?v3 - type_1)
 	      (pred_1 ?v5 - object ?v3 - type_1)
	      (pred_4 ?v2 - type_3 ?v7 - type_2)
	      (pred_2 ?v2 - type_3 ?v5 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v2 - type_3 ?v4 ?v8 - type_1)
       :precondition (and  (pred_3 ?v2 ?v4))
       :effect (and  (pred_3 ?v2 ?v8)
		     (not (pred_3 ?v2 ?v4))))

   (:action op_3
       :parameters (?v2 - type_3 ?v6 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v1) (pred_3 ?v2 ?v1) (pred_4 ?v2 ?v7))
       :effect (and (pred_2 ?v2 ?v6 ?v7)
		    (not (pred_1 ?v6 ?v1)) 
		    (not (pred_4 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_3 ?v6 - object ?v1 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v6 ?v7) (pred_3 ?v2 ?v1))
       :effect (and (pred_1 ?v6 ?v1)
		    (pred_4 ?v2 ?v7)
		    (not (pred_2 ?v2 ?v6 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_08 - type_3
obj_14 obj_13 obj_05 obj_09 - type_2
obj_03 obj_01 obj_11 obj_04 - type_1
obj_07 obj_10 obj_06 obj_12 - object)
(:init
(pred_3 obj_02 obj_03)
(pred_4 obj_02 obj_14)
(pred_4 obj_02 obj_13)
(pred_3 obj_08 obj_03)
(pred_4 obj_08 obj_05)
(pred_4 obj_08 obj_09)
(pred_1 obj_07 obj_03)
(pred_1 obj_10 obj_11)
(pred_1 obj_06 obj_03)
(pred_1 obj_12 obj_04)
)
(:goal
(and
(pred_1 obj_07 obj_04)
(pred_1 obj_10 obj_03)
(pred_1 obj_06 obj_11)
(pred_1 obj_12 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_11)))
)
)

; plan
1. (op_3 obj_08 obj_07 obj_03 obj_09)
   deleted: (pred_1 obj_07 obj_03) (pred_4 obj_08 obj_09)
   added: (pred_2 obj_08 obj_07 obj_09)
   goals met: 1 of 4
2. (op_3 obj_02 obj_06 obj_03 obj_13)
   deleted: (pred_1 obj_06 obj_03) (pred_4 obj_02 obj_13)
   added: (pred_2 obj_02 obj_06 obj_13)
   goals met: 1 of 4
3. (op_1 obj_08 obj_03 obj_04)
   deleted: (pred_3 obj_08 obj_03)
   added: (pred_3 obj_08 obj_04)
   goals met: 1 of 4
4. (op_2 obj_08 obj_07 obj_04 obj_09)
   deleted: (pred_2 obj_08 obj_07 obj_09)
   added: (pred_1 obj_07 obj_04) (pred_4 obj_08 obj_09)
   goals met: 2 of 4
5. (op_1 obj_08 obj_04 obj_11)
   deleted: (pred_3 obj_08 obj_04)
   added: (pred_3 obj_08 obj_11)
   goals met: 2 of 4
6. (op_3 obj_08 obj_10 obj_11 obj_09)
   deleted: (pred_1 obj_10 obj_11) (pred_4 obj_08 obj_09)
   added: (pred_2 obj_08 obj_10 obj_09)
   goals met: 2 of 4
7. (op_1 obj_08 obj_11 obj_03)
   deleted: (pred_3 obj_08 obj_11)
   added: (pred_3 obj_08 obj_03)
   goals met: 2 of 4
8. (op_2 obj_08 obj_10 obj_03 obj_09)
   deleted: (pred_2 obj_08 obj_10 obj_09)
   added: (pred_1 obj_10 obj_03) (pred_4 obj_08 obj_09)
   goals met: 3 of 4
9. (op_2 obj_02 obj_06 obj_03 obj_13)
   deleted: (pred_2 obj_02 obj_06 obj_13)
   added: (pred_1 obj_06 obj_03) (pred_4 obj_02 obj_13)
   goals met: 3 of 4
10. (op_3 obj_08 obj_06 obj_03 obj_09)
   deleted: (pred_1 obj_06 obj_03) (pred_4 obj_08 obj_09)
   added: (pred_2 obj_08 obj_06 obj_09)
   goals met: 3 of 4
11. (op_1 obj_08 obj_03 obj_11)
   deleted: (pred_3 obj_08 obj_03)
   added: (pred_3 obj_08 obj_11)
   goals met: 3 of 4
12. (op_2 obj_08 obj_06 obj_11 obj_09)
   deleted: (pred_2 obj_08 obj_06 obj_09)
   added: (pred_1 obj_06 obj_11) (pred_4 obj_08 obj_09)
   goals met: 4 of 4
